<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"581460930b54011c7ac95733f94ebd4b969cfb91b5380bf1a0b4dfc7367ab722","plan_job_ref":"Job Staging Environment #93 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9586329910","plan_out_hash":"f70513f5cbd15ff01a49b9281ca3c63f2d81dc33a969306c0d962872efd9c846","plan_hash":"06ff91e0dec3a35f25c4149df8715c4beac743df8f1a6c6db61187c662e1b5c6","plan_text_format":"diff","version":"1.43.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.devops will be updated in-place
!~  resource "aws_s3_object" "devops" {
!~      etag                          = "69bd63a3ba34c3c2058bc09a0734e8b1" -> "4271984ee9d66e4b8f71adb9c7029568"
        id                            = "devops.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.main-css will be updated in-place
!~  resource "aws_s3_object" "main-css" {
!~      etag                          = "2face158dc0959e681294690a7127838" -> "cd623d6a4f9e85f278a43d16fa11b128"
        id                            = "main.css"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                          = "ca00a81a73acc565f2de6aed905954ee" -> "e0ff210aee978d0780055019ad21c106"
        id                            = "index.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (24 unchanged attributes hidden)
    }

  # aws_s3_object.py-numbersapi will be created
+   resource "aws_s3_object" "py-numbersapi" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "image/png"
+       etag                   = "80710b6a549d020d2d368e0be5705ac6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "py-numbersapi.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/py-numbersapi.png"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.python will be created
+   resource "aws_s3_object" "python" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-portfolio-website-2.0"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/html"
+       etag                   = "026f1a610ba752df75da4c5ab6c428a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "python.html"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "../web/python.html"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "Environment" = "Dev Environment"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.wordpress will be updated in-place
!~  resource "aws_s3_object" "wordpress" {
!~      etag                          = "80a457bcc903589109975cf051ffb0ac" -> "0cb12c208ef0097fb89b70872ce467c3"
        id                            = "wordpress.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #93](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9586329910)